#lang sicp

;;  我们可以将阶乘表示为这样一个机器的模拟
;;  而实际上，我们的求值器可以被看作一种 "通用机器", 这个机器可以模拟任何其他的机器，只要他们已经被描述为求值器支持的那个程序
;;  这实际上就是图灵机的概念
;;
;;      ┌───────────────────────────────────────┐
;;      │ factorial                             │
;;      │                   1         │ 1       │
;;      │                   │         │         │
;;      │                   │       ┌─▼───┐     │
;;   6  │                 ┌─▼─┐     │ *   │     │
;;    ──┼────────o───────►│ = │     │   /*├─────┼───► 720
;;      │        │        └───┘     │  /  │     │
;;      │        │                  │ /*  │     │
;;      │        │                  └──▲──┘     │
;;      │        │                     │        │
;;      │        │                     │        │
;;      │        │                   ┌─┴─┐      │
;;      │        o───────────────────► * │      │
;;      │        │                   └─▲─┘      │
;;      │        │                     │        │
;;      │      ┌─▼─┐    ┌───────────┐  │        │
;;      │      │ - ├───►│ factorial ├──┘        │
;;      │      └─▲─┘    └───────────┘           │
;;      │        │                              │
;;      │         1                             │
;;      └───────────────────────────────────────┘
;;
;;

(eval '(* 5 5) (scheme-report-environment 5))
(eval (cons '* (list 5 5)) (scheme-report-environment 5))
